# 5. 데이터 확인

In [4]:
import pandas as pd
df=pd.read_csv("score.csv")
df.index.name ="지원번호"
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
0     채치수  북산고  197   90   85  100  95  85      Python
1     정대만  북산고  184   40   35   50  55  25        Java
2     송태섭  북산고  168   80   75   70  80  75  Javascript
3     서태웅  북산고  187   40   60   70  75  80         NaN
4     강백호  북산고  188   15   20   10  35  10         NaN
5     변덕규  능남고  202   80  100   95  85  80           C
6     황태산  능남고  188   55   65   46  40  35      Python
7     윤대협  능남고  190  100   85   90  95  95          C#

## DataFrame 확인
계산 가능한 데이터에 대해 column 별로 데이터의 갯수, 평균, 표준편차, 최소/최대값 등의 정보를 보여줌.

In [6]:
df.describe()
#데이터의 값에 대한 정보가 나옴.
# 계산을 할 수 있는 데이터에 대해서 각 column 별로 계산해서 보여줌.

                키          국어          영어          수학         과학         사회
count    8.000000    8.000000    8.000000    8.000000   8.000000   8.000000
mean   188.000000   62.500000   65.625000   66.375000  70.000000  60.625000
std      9.985704   29.519969   26.917533   30.227412  23.754699  32.120032
min    168.000000   15.000000   20.000000   10.000000  35.000000  10.000000
25%    186.250000   40.000000   53.750000   49.000000  51.250000  32.500000
50%    188.000000   67.500000   70.000000   70.000000  77.500000  77.500000
75%    191.750000   82.500000   85.000000   91.250000  87.500000  81.250000
max    202.000000  100.000000  100.000000  100.000000  95.000000  95.000000

In [7]:
df.info()
#어떤 데이터 형식인지 판단

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학교      8 non-null      object
 2   키       8 non-null      int64
 3   국어      8 non-null      int64
 4   영어      8 non-null      int64
 5   수학      8 non-null      int64
 6   과학      8 non-null      int64
 7   사회      8 non-null      int64
 8   SW특기    6 non-null      object
dtypes: int64(6), object(3)
memory usage: 708.0+ bytes

In [8]:
df.head()
#처음 5개의 row를 갖옴 ,

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
0     채치수  북산고  197  90  85  100  95  85      Python
1     정대만  북산고  184  40  35   50  55  25        Java
2     송태섭  북산고  168  80  75   70  80  75  Javascript
3     서태웅  북산고  187  40  60   70  75  80         NaN
4     강백호  북산고  188  15  20   10  35  10         NaN

In [9]:
df.head(7)
#처음 7개의 row를 가져옴.

       이름   학교    키  국어   영어   수학  과학  사회        SW특기
지원번호
0     채치수  북산고  197  90   85  100  95  85      Python
1     정대만  북산고  184  40   35   50  55  25        Java
2     송태섭  북산고  168  80   75   70  80  75  Javascript
3     서태웅  북산고  187  40   60   70  75  80         NaN
4     강백호  북산고  188  15   20   10  35  10         NaN
5     변덕규  능남고  202  80  100   95  85  80           C
6     황태산  능남고  188  55   65   46  40  35      Python

In [11]:
df.tail()
#마지막 5개의 row 가져옴

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
3     서태웅  북산고  187   40   60  70  75  80     NaN
4     강백호  북산고  188   15   20  10  35  10     NaN
5     변덕규  능남고  202   80  100  95  85  80       C
6     황태산  능남고  188   55   65  46  40  35  Python
7     윤대협  능남고  190  100   85  90  95  95      C#

In [12]:
df.tail(3)
#마지막 3개 row 가져옴

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
5     변덕규  능남고  202   80  100  95  85  80       C
6     황태산  능남고  188   55   65  46  40  35  Python
7     윤대협  능남고  190  100   85  90  95  95      C#

In [13]:
df.values
#어떤 값을 가지고 있는지 확인

array([['채치수', '북산고', 197, 90, 85, 100, 95, 85, 'Python'],
       ['정대만', '북산고', 184, 40, 35, 50, 55, 25, 'Java'],
       ['송태섭', '북산고', 168, 80, 75, 70, 80, 75, 'Javascript'],
       ['서태웅', '북산고', 187, 40, 60, 70, 75, 80, nan],
       ['강백호', '북산고', 188, 15, 20, 10, 35, 10, nan],
       ['변덕규', '능남고', 202, 80, 100, 95, 85, 80, 'C'],
       ['황태산', '능남고', 188, 55, 65, 46, 40, 35, 'Python'],
       ['윤대협', '능남고', 190, 100, 85, 90, 95, 95, 'C#']], dtype=object)

In [14]:
df.index

RangeIndex(start=0, stop=8, step=1, name='지원번호')

In [15]:
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [16]:
df.shape
#(row,column) 개수 확인.

(8, 9)

## Series 확인

In [17]:
df['키'].describe()

count      8.000000
mean     188.000000
std        9.985704
min      168.000000
25%      186.250000
50%      188.000000
75%      191.750000
max      202.000000
Name: 키, dtype: float64

In [19]:
df['키'].min()

168

In [21]:
df['키'].max()

202

In [22]:
df["키"].nlargest(3) # 키 큰 사람 순서대로 3명 데이터

지원번호
5    202
0    197
7    190
Name: 키, dtype: int64

In [23]:
df['키'].nsmallest(3)

지원번호
2    168
1    184
3    187
Name: 키, dtype: int64

In [24]:
df["키"].mean()

np.float64(188.0)

In [26]:
df["키"].sum()
#다 더하기

np.int64(1504)

In [27]:
df["SW특기"].count()
# NaN은 없기에 존재하는 데이터만 보여준다.

np.int64(6)

In [28]:
df['학교'].unique()
#중복을 제외하고 유니크한 값만 알려주기

array(['북산고', '능남고'], dtype=object)

In [30]:
df["학교"].nunique()
#유니크한 학교 개수 알려주기

2